backend/modules/worlds/status/controllers/StatusController.php

    public function actionCreate()
    {
        $model = new Status();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `status` (`name`) VALUES ('ลิงค์เสีย')

    protected function findModel($id)
    {
        if (($model = Status::findOne($id)) !== null) {
---
SELECT * FROM `status` WHERE `id`='1'