backend/modules/worlds/coverimg/controllers/CoverimgController.php

    public function actionCreate()
    {
        $model = new Coverimg();

        if ($model->load(Yii::$app->request->post())) {

          $file = UploadedFile::getInstance($model,'cover');

          // if ($file->size!= 0 ) {
          //   Yii::$app->session->setFlash('warning', 'Check your  file size .');
          //   return $this->refresh();
          // }
            if ($file->size > 409600) {
                Yii::$app->session->setFlash('warning', 'ไฟล์ขนาดใหญ่เกินไป โปรดเลือกไฟล์ใหม่.');
                  return $this->refresh();
            }else {
              $model->filename = $file->name;
              $file->saveAs('uploads/coverimage/'.$file->name );
              $model->save();
---
INSERT INTO `cover_img` (`filename`) VALUES ('SavedPhoto(1).png')

    protected function findModel($id)
    {
        if (($model = Coverimg::findOne($id)) !== null) {
---
SELECT * FROM `cover_img` WHERE `id`='4'